Revit 2027 API
View.IsTemporaryHideIsolateActive Method
 Indicates if the view is temporarily hiding or isolating elements or categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTemporaryHideIsolateActive()
Public Function IsTemporaryHideIsolateActive As Boolean
public:
bool IsTemporaryHideIsolateActive()
member IsTemporaryHideIsolateActive : unit -> bool
Return Value
Boolean
 True if elements/categories are being temporarily hidden or isolated, false otherwise.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace